<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>R&eacute;seau sous Linux :: Glossaire des termes utilis&eacute;s dans ce document.</TITLE>
 <LINK HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-13.html" REL=next>
 <LINK HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-11.html" REL=previous>
 <LINK HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO.html#toc12" REL=contents>
</HEAD>
<BODY>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-13.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-11.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO.html#toc12"><IMG SRC="toc.gif" ALT="Table des matières"></A>
<HR>
<H2><A NAME="s12">12. Glossaire des termes utilis&eacute;s dans ce document.</A></H2>

<P>Ci-dessous une liste des termes les plus importants utilis&eacute;s dans ce document.
<DL>
<DT><B>ARP</B><DD><P>C'est l'acronyme de <EM>Address Resolution Protocol</EM>
(protocole de r&eacute;solution d'adresses), permettant &agrave; une machine du
r&eacute;seau d'associer une adresse IP &agrave; une adresse mat&eacute;rielle.
<DT><B>ATM</B><DD><P>C'est l'acronyme de <EM>Asynchronous Transfer Mode</EM> 
(mode de transfert asynchrone). Un r&eacute;seau ATM enveloppe les 
donn&eacute;es en blocs de taille standard pour pouvoir les convoyer
efficacement d'un point &agrave; un autre. ATM est une technologie
r&eacute;seau &agrave; commutation de paquets.
<DT><B>client</B><DD><P>C'est habituellement le morceau de logiciel 
d'un syst&egrave;me du c&ocirc;t&eacute; o&ugrave; se trouve l'utilisateur.
Il y a des exceptions, par exemple, dans le syst&egrave;me de fen&ecirc;tres
X11 c'est en fait le serveur qui est avec l'utilisateur et 
le client qui est sur la
machine distante. Le client est le programme ou l'extr&eacute;mit&eacute; d'un
syst&egrave;me qui utilise le service fourni par un 
serveur. Dans le cas de 
syst&egrave;mes <EM>d'&eacute;gal &agrave; &eacute;gal</EM> tels que <EM>slip</EM> ou
<EM>ppp</EM> le client se trouve &agrave; l'extr&eacute;mit&eacute; qui a 
initialis&eacute; la connexion, l'autre extr&eacute;mit&eacute;, &eacute;tant
consid&eacute;r&eacute;e comme le serveur.
<DT><B>datagramme</B><DD><P>Un datagramme est un paquet discret de donn&eacute;es
qui contient les adresses, et qui est l'unit&eacute; de base de transmission
sur un r&eacute;seau IP. On peut aussi l'appeler `paquet'.
<DT><B>DLCI</B><DD><P>DLCI veut dire `Data Link Connection Identifier'(identifieur
de connexion de liaison de donn&eacute;es), et est utilis&eacute; pour
identifier une liaison virtuelle unique point &agrave; point via un
r&eacute;seau &agrave; relais de trames (Frame Relay). Les DLCI sont
normalement assign&eacute;s par le fournisseur de r&eacute;seau &agrave;
relais de trames.
<DT><B>Relais de trames</B><DD><P>Frame Relay (Relais de trames) est une technologie
r&eacute;seau id&eacute;ale lorsque l'on a un 
trafic de nature cahotique ou sporadique. Les co&ucirc;ts peuvent &ecirc;tre
r&eacute;duits quand on a de nombreux clients partageant la
m&ecirc;me capacit&eacute; r&eacute;seau et on compte sur le fait que
les clients utilisent le r&eacute;seau &agrave; des instants
diif&eacute;rents.
<DT><B>Adresse mat&eacute;rielle</B><DD><P>C'est un nombre qui identifie de 
mani&egrave;re unique un h&ocirc;te sur un r&eacute;seau physique au niveau
de la couche acc&egrave;s. Par exemple :
<EM>Adresses Ethernet</EM> et <EM>Adresses AX.25</EM>.
<DT><B>ISDN</B><DD><P>C'est l'acronyme de <EM>Integrated Services Digital
Network</EM>(R&eacute;seau Num&eacute;rique &agrave; Int&eacute;gration de
Services=RNIS). Il fournit des moyens standardis&eacute;s avec lesquels
les compagnies de t&eacute;l&eacute;communications peuvent d&eacute;livrer
soit de la voix soit des informations vers des clients.
Techniquement c'est un r&eacute;seau de donn&eacute;es &agrave; commutation de paquets.
<DT><B>ISP</B><DD><P>C'est l'acronyme de `Internet Service Provider' (fournisseur
d'acc&egrave;s &agrave; l'Internet=FAI). Ce sont des organisations ou des
soci&eacute;t&eacute;s qui fournissent une connexion r&eacute;seau &agrave; l'Internet au public.
<DT><B>Adresse IP</B><DD><P>C'est un nombre qui identifie de mani&egrave;re unique
un h&ocirc;te TCP/IP sur le r&eacute;seau. Cette adresse est 
cod&eacute;e sur 4 octets et
se pr&eacute;sente habituellement sous la forme appel&eacute;e "notation
d&eacute;cimale point&eacute;e", o&ugrave; chaque octet est sous forme 
d&eacute;cimale, avec un point `.' entre chaque.
<DT><B>MSS</B><DD><P>Le Maximum Segment Size (<EM>MSS</EM>) (Taille Maximum de
Segment) est la plus grande quantit&eacute; de donn&eacute;es qui peut
&ecirc;tre transmise en une seule fois. Si vous voulez &eacute;viter
des fragmentations MSS doit &ecirc;tre &eacute;gal &agrave; l'en-t&ecirc;te
MTU-IP.
<DT><B>MTU</B><DD><P>Le Maximum Transmission Unit (<EM>MTU</EM>) (taille maximum
de l'unit&eacute; de transfert) est un param&egrave;tre qui d&eacute;termine
le plus long datagramme pouvant &ecirc;tre transmis par une interface IP
sans avoir besoin d'&ecirc;tre fragment&eacute; en unit&eacute;s plus petites.
Le MTU doit &ecirc;tre plus grand que le datagramme le plus grand que vous
voulez transmettre sans &ecirc;tre fragment&eacute;. Note : ceci prot&egrave;ge
de la fragmentation uniquement de mani&egrave;re locale, d'autres liens
sur le chemin peuvent avoir un MTU plus petit et les datagrammes seront
fragment&eacute;s &agrave; cet endroit. Les valeurs typiques sont de 1500 octets
pour une interface Ethernet, ou de 576 octets pour une interface SLIP.
<DT><B>route</B><DD><P>La <EM>route</EM> est le chemin que les datagrammes suivent
&agrave; travers le r&eacute;seau pour atteindre leur destination.
<DT><B>serveur</B><DD><P>C'est habituellement le morceau de logiciel ou 
l'extr&eacute;mit&eacute; d'un syst&egrave;me &eacute;loign&eacute; de
l'utilisateur. Le serveur fournit un service vers un ou plusieurs clients.
Des exemples de serveurs sont
<EM>ftp</EM>, <EM>Networked File System</EM> (NFS), ou
<EM>Domain Name Server</EM> (DNS). Dans le cas de syst&egrave;mes <EM>&eacute;gal
&agrave; &eacute;gal</EM> comme
<EM>SLIP</EM> ou <EM>PPP</EM> le serveur est consid&eacute;r&eacute; comme &eacute;tant
l'extr&eacute;mit&eacute; de la liaison qui est appel&eacute;e et 
l'extr&eacute;mit&eacute; appeleante est le client.
<DT><B>fen&ecirc;tre</B><DD><P>La <EM>fen&ecirc;tre</EM> (window) est la plus
grande quantit&eacute; de donn&eacute;es que l'extr&eacute;mit&eacute; 
r&eacute;ceptrice peut accepter &agrave; un certain moment.
</DL>
<P>
<HR>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-13.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO-11.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Net-HOWTO-html/Net-HOWTO.html#toc12"><IMG SRC="toc.gif" ALT="Table des matières"></A>
</BODY>
</HTML>
