<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>The Unix and Internet Fundamentals HOWTO: Comment mon ordinateur fait-il plusieurs choses en m&ecirc;me temps ?</TITLE>
 <LINK HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-7.html" REL=next>
 <LINK HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-5.html" REL=previous>
 <LINK HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-7.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-5.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc6"><IMG SRC="toc.gif" ALT="Table des matières"></A>
<HR>
<H2><A NAME="s6">6. Comment mon ordinateur fait-il plusieurs choses en m&ecirc;me temps ?</A></H2>

<P>En fait, il ne le fait pas. Les ordinateurs ne peuvent traiter qu'une seule
t&acirc;che (ou <EM>processus</EM>) &agrave; la fois. Mais un ordinateur peut changer
de t&acirc;che tr&egrave;s rapidement, et duper l'esprit humain en lui faisant
croire qu'il fait plusieurs choses en m&ecirc;me temps. C'est ce que l'on
appelle le <EM>temps partag&eacute;</EM>.
<P>Une des t&acirc;ches du noyau est de g&eacute;rer le temps partag&eacute;. C'est une partie
d&eacute;di&eacute;e &agrave; l'<EM>ordonnanceur</EM> qui conserve chez lui
toutes les informations sur les autres processus (non noyau) de votre
environnement. Chaque 1/60 &egrave;me de seconde, une horloge avertit le
noyau, g&eacute;n&eacute;rant une interruption horloge. L'ordonnanceur arr&ecirc;te le
processus qui s'ex&eacute;cute, le suspend dans l'&eacute;tat, et donne le contr&ocirc;le &agrave;
un autre processus.
<P>1/60 &egrave;me de seconde peut para&icirc;tre peu de temps. Mais sur les
microprocesseurs actuels c'est assez pour ex&eacute;cuter des dizaines de
milliers d'instructions machine, ce qui permet d'effectuer beaucoup de
choses. M&ecirc;me si vous avez plusieurs processus, chacun peut accomplir 
un petit peu sa t&acirc;che pendant ses tranches de temps.
<P>En pratique, un programme ne dispose pas de sa tranche de temps enti&egrave;re. Si
une interruption arrive d'un p&eacute;riph&eacute;rique d'E/S, le noyau arr&ecirc;tera en
r&eacute;alit&eacute; la t&acirc;che courante, ex&eacute;cutera le handler d'interruption et
retournera &agrave; la t&acirc;che courante. Une temp&ecirc;te d'interruption de haute
priorit&eacute; peut interdire tout traitement normal&nbsp;; ce mauvais comportement
est appel&eacute; <EM>d&eacute;faite (thrashing)</EM> et est difficile &agrave; provoquer
sur les Unix modernes.
<P>En fait, la vitesse des programmes est tr&egrave;s rarement limit&eacute;e par le temps
machine qu'ils peuvent obtenir (il y a quelques exceptions &agrave; cette
r&egrave;gle, comme la g&eacute;n&eacute;ration de son ou de graphiques en 3-D. Le plus
souvent, les d&eacute;lais sont dus &agrave; l'attente, par le programme, des
donn&eacute;es d'un disque ou d'une connexion r&eacute;seau.
<P>Un syst&egrave;me d'exploitation qui peut supporter de mani&egrave;re routini&egrave;re
plusieurs processus est appel&eacute; "multit&acirc;che". Les syst&egrave;mes
d'exploitation de la famille Unix ont &eacute;t&eacute; con&ccedil;us d&egrave;s le d&eacute;but pour le
multit&acirc;che et sont vraiment bons pour &ccedil;a --&nbsp;beaucoup plus efficaces que
celui de Windows et MAC OS, pour lesquels le multit&acirc;che a &eacute;t&eacute; introduit
a posteriori et qui le traitent plut&ocirc;t pauvrement. Efficace,
multit&acirc;che, fiable sont quelques-unes des raisons qui rendent Linux
sup&eacute;rieur pour le r&eacute;seau, les communications et les services WEB.
<P>
<HR>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-7.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-5.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc6"><IMG SRC="toc.gif" ALT="Table des matières"></A>
</BODY>
</HTML>
