<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>The Unix and Internet Fundamentals HOWTO: Introduction</TITLE>
 <LINK HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-2.html" REL=next>

 <LINK HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-2.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<IMG SRC="prev.gif" ALT="Page précédente">
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc1"><IMG SRC="toc.gif" ALT="Table des matières"></A>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>
<P>
<H2><A NAME="ss1.1">1.1 Sujet de ce document</A>
</H2>

<P>Ce document est con&ccedil;u pour aider les utilisateurs de Linux et d'Internet
qui d&eacute;sirent apprendre en faisant. Bien que ce soit un bon moyen
d'acqu&eacute;rir des comp&eacute;tences, quelquefois cela laisse de singuli&egrave;res
lacunes dans la connaissance des bases --&nbsp;lacunes qui peuvent rendre
difficile la r&eacute;flexion cr&eacute;ative ou perturber fortement, par manque
d'un mod&egrave;le mental clair sur ce qu'il devrait se passer.
<P>J'essaierai de d&eacute;crire clairement, dans un langage simple, comment tout
marche. La pr&eacute;sentation sera adapt&eacute;e aux personnes qui utilisent
Unix ou Linux sur du mat&eacute;riel de type PC. Cependant, je ferai ici
couramment r&eacute;f&eacute;rence &agrave; 'Unix'&nbsp;: ce que je d&eacute;crirai se retrouvera sur
toutes les plates-formes et sur toutes les variantes d'Unix.
<P>Je suppose que vous utilisez un PC avec un processeur de type Intel. Les
d&eacute;tails diff&egrave;rent quelque peu si vous utilisez un processeur Alpha ou
PowerPC ou une autre machine Unix, mais les concepts de base restent
les m&ecirc;mes.
<P>Je ne voudrais pas r&eacute;p&eacute;ter les choses, alors vous allez devoir faire
attention, mais cela veut dire que vous retiendrez chaque mot que vous
lirez. C'est une bonne id&eacute;e que de tout parcourir rapidement la premi&egrave;re
fois&nbsp;; vous devrez y revenir et relire un certain nombre de fois afin
de dig&eacute;rer ce que vous avez appris. 
<P>C'est un document en permanente &eacute;volution. Je pr&eacute;vois d'ajouter des
chapitres en r&eacute;ponse aux feedbacks, ainsi vous pourrez p&eacute;riodiquement
le passer en revue.
<P>
<H2><A NAME="ss1.2">1.2 Ressources rattach&eacute;es</A>
</H2>

<P>Si vous lisez dans l'espoir d'apprendre comment 'hacker', vous devrez
lire 
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/http://www.tuxedo.org/~esr/faqs/hacker-howto.html">How To Become A Hacker FAQ</A>. Il y a beaucoup de liens vers
d'autres ressources utiles.
<P>
<P>
<H2><A NAME="ss1.3">1.3 Nouvelles versions de ce document</A>
</H2>

<P>
<P>Les nouvelles versions de 'Unix and Internet Fundamentals HOWTO' seront
post&eacute;es p&eacute;riodiquement dans 
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/news:comp.os.linux.help">comp.os.linux.help</A> et 
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/news:comp.os.linux.announce">news:comp.os.linux.announce</A> et 
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/news:answers">news.answers</A>. Elles pourront &ecirc;tre t&eacute;l&eacute;charg&eacute;es &agrave; partir de
divers sites Linux WWW ou FTP, y compris la page d'accueil du LDP. 
<P>Vous pouvez acc&eacute;der &agrave; la derni&egrave;re version (en anglais) de ce document sur le World Wide
Web via l'URL 
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/http://sunsite.unc.edu/LDP/HOWTO/Unix-Internet-Fundamentals-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Unix-Internet-Fundamentals-HOWTO.html</A>. 
<P>
<H2><A NAME="ss1.4">1.4 R&eacute;actions et corrections</A>
</H2>

<P>
<P>Si vous avez des questions ou des commentaires &agrave; propos de ce document,
vous pouvez envoyer vos courriers &eacute;lectroniques &agrave; Eric S. Raymond, &agrave;
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/mailto:esr@thyrsus.com">esr@thyrsus.com</A>. Toutes
suggestions ou critiques seront les bienvenues. Seront sp&eacute;cialement
appr&eacute;ci&eacute;s les liens hypertexte vers des explications plus d&eacute;taill&eacute;es
ou vers des concepts propres. Si vous trouvez des erreurs dans ce
document, faites-le moi savoir afin que je puisse les corriger dans la
nouvelle version. Merci.
<P>
<HR>
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO-2.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<IMG SRC="prev.gif" ALT="Page précédente">
<A HREF="index.php?ref=Unix-Internet-Fundamentals-HOWTO-html/Unix-Internet-Fundamentals-HOWTO.html#toc1"><IMG SRC="toc.gif" ALT="Table des matières"></A>
</BODY>
</HTML>
