<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.7">
 <TITLE>Possibilit&eacute;s r&eacute;seau de Linux HOWTO: Linux.</TITLE>
 <LINK HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-3.html" REL=next>
 <LINK HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-1.html" REL=previous>
 <LINK HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-3.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-1.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO.html#toc2"><IMG SRC="toc.gif" ALT="Table des matières"></A>
<HR>
<H2><A NAME="s2">2. Linux.</A></H2>

<H2><A NAME="ss2.1">2.1 Qu'est ce que Linux ?</A>
</H2>

<P>L'auteur principal de Linux est Linus Torvalds. Depuis la premi&egrave;re version, ce syst&egrave;me a &eacute;t&eacute; am&eacute;lior&eacute; par un nombre impressionnant de personnes. C'est un clone, &eacute;crit &agrave; partir de rien, du syst&egrave;me d'exploitation UNIX. Le plus int&eacute;ressant &agrave; propos de Linux, c'est que son d&eacute;veloppement se fait simultan&eacute;ment tout autour du monde. 
<P>Linux est prot&eacute;g&eacute; par la Licence GNU (GPL). Cette licence a &eacute;t&eacute; &eacute;crite par la Free Software Foundation (FSF), elle est faite pour emp&ecirc;cher les gens de restreindre la distribution des logiciels. En gros, &ccedil;a dit que bien que l'on puisse demander de l'argent pour la distribution, la personne qui a re&ccedil;u la copie a le droit de la redistribuer gratuitement. Cela dit aussi que le code source doit &ecirc;tre disponible. C'est tr&egrave;s utile pour les programmeurs. N'importe qui peut modifier Linux et m&ecirc;me distribuer ses modifications, tant que le code reste dans le m&ecirc;me copyright.
<P>
<H2><A NAME="ss2.2">2.2 Qu'est ce qui fait que Linux est diff&eacute;rent ?</A>
</H2>

<P>Pourquoi travailler sur Linux ? Linux est g&eacute;n&eacute;ralement moins cher (ou du moins pas plus cher) que les autres syst&egrave;mes d'exploitation, et cr&eacute;e fr&eacute;quemment moins de probl&egrave;mes que les syst&egrave;mes commerciaux. Mais ce qui fait que Linux est diff&eacute;rent n'est pas le prix (apr&egrave;s tout, pourquoi voudrait-on d'un syst&egrave;me - m&ecirc;me s'il est gratuit - s'il n'est pas bien ?), mais ses &eacute;tonnantes capacit&eacute;s :
<P>
<UL>
<LI>Linux est un vrai syst&egrave;me d'exploitation multit&acirc;che 32 bits, suffisamment solide et puissant pour &ecirc;tre utilis&eacute; des universit&eacute;s jusque dans les grandes entreprises.</LI>
<LI>Il fonctionne sur un nombre impressionnant de machines, depuis les 386 bas de gamme, jusqu'aux machines massivement parall&egrave;les des centres de recherches.</LI>
<LI>Il y a des versions disponibles pour les architectures Intel/Sparc/Alpha, et un support exp&eacute;rimental des Power PC et des syst&egrave;mes tels SGI, Ultra Sparc, AP1000+, Strong ARM, MIPS R3000/R4000...</LI>
<LI>Finalement, quand on arrive &agrave; la partie r&eacute;seau, Linux est "le" choix; non seulement parce que la couche r&eacute;seau est profond&eacute;ment int&eacute;gr&eacute;e dans le syst&egrave;me, ainsi qu'&agrave; cause du nombre impressionnant d'applications disponibles, mais aussi gr&acirc;ce &agrave; sa robustesse lorsque le syst&egrave;me est tr&egrave;s charg&eacute;, chose qui ne peut &ecirc;tre accomplie dans un tel projet qu'apr&egrave;s des ann&eacute;es de debuggage et de tests.</LI>
</UL>
<P>
<HR>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-3.html"><IMG SRC="next.gif" ALT="Page suivante"></A>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO-1.html"><IMG SRC="prev.gif" ALT="Page précédente"></A>
<A HREF="index.php?ref=Networking-Overview-HOWTO-html/Networking-Overview-HOWTO.html#toc2"><IMG SRC="toc.gif" ALT="Table des matières"></A>
</BODY>
</HTML>
